{
	"intents": 
	[
				{
			"tag": "greeting",
			"patterns": ["Hi there", "Is anyone there?","Hey","Hola", "Hello", "Good day"],
			"responses": ["Hello, how can I help?", "Hello, what is your Problem?", "Hi there, how can I help?"]
        		},
        		{
            "tag": "goodbye",
            "patterns": ["Bye", "See you later", "Goodbye", "Nice chatting to you, bye", "Till next time", "No, that's it"],
            "responses": ["See you!", "Have a nice day", "Bye! Come back again soon.","Bye! Hope you don't see me soon"]
                },
                {
            "tag": "thanks",
            "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me"],
            "responses": ["Happy to help!", "Any time!", "My pleasure"]
                },
                {
            "tag": "reservation in educational instituations",
            "patterns": ["reservation", "Reservations", "reservations", "Reservation"],
            "responses": [" Notwithstanding anything in any other law for the time being in force, there shall be reservation of posts in direct recruitment out of the sanctioned strength in teachers' cadre in a Central Educational Institution to the extent and in the manner as may be specified by the Central Government by notification in the Official Gazette."]
                },
                {
            "tag": "talaq",
            "patterns": ["Talaq", "talaq", "Divorce", "divorce"],
            "responses": ["Any pronouncement of talaq by a Muslim husband upon his wife, by words, either spoken or written or in electronic form or in any other manner whatsoever, shall be void and illegal."]
                },
                {
            "tag": "talaq punishment",
            "patterns": ["pronouncing talaq", "saying talaq", "divorce not legally"],
            "responses": ["Any Muslim husband who pronounces talaq referred to in section 3 upon his wife shall be punished with imprisonment for a term which may extend to three years, and shall also be liable to fine."]
                },
                {
            "tag": "Fraudulent Deposits",
            "patterns": ["Fraudulent", "Deposit"],
            "responses": ["No deposit taker, while accepting deposits pursuant to a Regulated Deposit Scheme, shall commit any fraudulent default in the repayment or return of deposit on maturity or in rendering any specified service promised against such deposit."]
                },
                {
            "tag": "Information of business by deposit taker",
            "patterns": ["Information" ,"business by deposit"],
            "responses": ["Every deposit taker which commences or carries on its business as such on or after the commencement of this Act shall intimate the authority referred to in sub-section (1) of section 9 about its business in such form and manner and within such time, as may be prescribed."]
                },
                {
            "tag": "Sexual harassment of women",
            "patterns": ["sexual" ,"sexual harassment" ,"women harassment"],
            "responses": ["Sexual harassment in relation to a workplace, a woman, of any age whether employed or not, who alleges tohave been subjected to any act of sexual harassment by the respondent."]
                },
                {
            "tag":  "rape",
            "patterns": ["rape" ,"women rape", "physical harassment"],
            "responses": ["Rape includes any one or more of the following unwelcome acts or behavior (whether directly or by implication) namely physical contact and advances; or a demand or request for sexual favours; or making sexually coloured remarks; or showing pornography; or any other unwelcome physical, verbal or non-verbal conduct of sexual nature;"]
                },
                {
                    "tag":  "Prevention of sexual harassment",
                    "patterns": ["prevention" ,"Prevention of sexual harassment", "humiliation"],
                    "responses": ["No woman shall be subjected to sexual harassment workplace. (2) The following circumstances, among other circumstances, if it occurs, or is present in relation t or connected with any act or behavior of sexual harassment may amount to sexual harassment:— (i) implied or explicit promise of preferential treatment in her employment; or (ii) implied or explicit threat of detrimental treatment in her employment ; or (iii) implied or explicit threat about her present or future employment status; or (iv) interference with her work or creating an intimidating or offensive or hostile environment for her; or (v) humiliating treatment likely to affect her health or safety."]
                },
                {
                    "tag":  "Child Marriage Act, 2006",
                    "patterns": ["Child Marriage Act, 2006" ,"Prevention of Child Marriage Act, 2006", "child marriages","child marriage"],
                    "responses": ["Every child marriage, whether solemnised before or after the commencement of this Act, shall be voidable at the option of the contracting party who was a child at the time of the marriage: Provided that a petition for annulling a child marriage by a decree of nullity may be filed in the district court only by a contracting party to the marriage who was a child at the time of the marriage. (2) If at the time of filing a petition, the petitioner is a minor, the petition may be filed through his orher guardian or next friend along with the Child Marriage Prohibition Officer.(3) The petition under this section may be filed at any time but before the child filing the petition completes two years of attaining majority."] 
                }

                
        ]
}